app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Math"], ["room_number", 1], ["created_at", "2020-07-20 16:36:32.854492"], ["updated_at", "2020-07-20 16:36:32.854492"]]
---
    def create
        @school_class = SchoolClass.new(s_params)
        @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Chemistry"], ["room_number", 4], ["updated_at", "2020-07-20 16:39:43.370905"], ["id", 3]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(s_params)