app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Rick"], ["last_name", "Sanchez"], ["created_at", "2020-07-20 16:25:21.298621"], ["updated_at", "2020-07-20 16:25:21.298621"]]
---
    def create
        @student = Student.new(s_params)
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Morthy"], ["last_name", "Smith"], ["updated_at", "2020-07-20 16:25:51.046773"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(s_params)